{
  "tag": "3.1.0",
  "name": "Release 3.1.0",
  "body": "Update from the previous version by following the [update guide](docs/Updating_the_App.md).\n\nFor a full list of changes see [Milestone v3.1.0](https://github.com/ownrecipes/OwnRecipes/milestone/1?closed=1).\n\nWeb:\n- Forms are now implemented with react-final-form. This fixes some nasty bugs. ([#59](https://github.com/ownrecipes/OwnRecipes/issues/59), [#60](https://github.com/ownrecipes/OwnRecipes/issues/60), [#68](https://github.com/ownrecipes/OwnRecipes/issues/68))\n- On recipe pages there is a 'Wake lock'-function, that will keep the display awake. This functionality must now be manually triggered via a new button on the page, to prevent accidentally draining the smartphone battery. ([#53](https://github.com/ownrecipes/OwnRecipes/issues/53))\n- The 'Wake lock'-function will now pause after 30 minutes, to prevent battery drain. ([#53](https://github.com/ownrecipes/OwnRecipes/issues/53))\n- The search browser won't query any filters on first load, to reduce power usage and thus give some more space for more filters that are planned. ([#61](https://github.com/ownrecipes/OwnRecipes/issues/61))\n- The recipe directions will now show the ingredients for each section. The mapping is done automatically via the section's headlines. This is pretty cool on smartphones, try it out! :-) ([#69](https://github.com/ownrecipes/OwnRecipes/issues/69))\n- On the login page there is now an option to opt-out of remembering the login. This is to better inform the users how the login behave. ([#72](https://github.com/ownrecipes/OwnRecipes/issues/72))\n\nApi:\n- Made some recipe fields optional, that the web does not have to send fake dummy data. This is purely internal behaviour, but requires data migrations. ([#71](https://github.com/ownrecipes/OwnRecipes/issues/71))\n\nDependencies:\n- Api: Django 3.2.16, gunicorn 20.1.0, python 3.8.13\n- Web: React 18.0.2, React-Bootstrap 2.5.0, Node 16.15",
  "target": "master",
  "draft": false,
  "prerelease": false
}